MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECG124/mcu.h
extern volatile __AD1DATA19bits_t AD1DATA19bits __asm__ ("AD1DATA19") __attribute__((section("sfrs"), address(0xBF84B104)));
#define AD1DATA20 AD1DATA20
extern volatile uint32_t   AD1DATA20 __attribute__((section("sfrs"), address(0xBF84B108)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA20bits_t;
extern volatile __AD1DATA20bits_t AD1DATA20bits __asm__ ("AD1DATA20") __attribute__((section("sfrs"), address(0xBF84B108)));
#define AD1DATA21 AD1DATA21
extern volatile uint32_t   AD1DATA21 __attribute__((section("sfrs"), address(0xBF84B10C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA21bits_t;
extern volatile __AD1DATA21bits_t AD1DATA21bits __asm__ ("AD1DATA21") __attribute__((section("sfrs"), address(0xBF84B10C)));
#define AD1DATA22 AD1DATA22
extern volatile uint32_t   AD1DATA22 __attribute__((section("sfrs"), address(0xBF84B110)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA22bits_t;
extern volatile __AD1DATA22bits_t AD1DATA22bits __asm__ ("AD1DATA22") __attribute__((section("sfrs"), address(0xBF84B110)));
#define AD1DATA23 AD1DATA23
extern volatile uint32_t   AD1DATA23 __attribute__((section("sfrs"), address(0xBF84B114)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA23bits_t;
extern volatile __AD1DATA23bits_t AD1DATA23bits __asm__ ("AD1DATA23") __attribute__((section("sfrs"), address(0xBF84B114)));
#define AD1DATA24 AD1DATA24
extern volatile uint32_t   AD1DATA24 __attribute__((section("sfrs"), address(0xBF84B118)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA24bits_t;
extern volatile __AD1DATA24bits_t AD1DATA24bits __asm__ ("AD1DATA24") __attribute__((section("sfrs"), address(0xBF84B118)));
#define AD1DATA25 AD1DATA25
extern volatile uint32_t   AD1DATA25 __attribute__((section("sfrs"), address(0xBF84B11C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA25bits_t;
extern volatile __AD1DATA25bits_t AD1DATA25bits __asm__ ("AD1DATA25") __attribute__((section("sfrs"), address(0xBF84B11C)));
#define AD1DATA26 AD1DATA26
extern volatile uint32_t   AD1DATA26 __attribute__((section("sfrs"), address(0xBF84B120)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA26bits_t;
extern volatile __AD1DATA26bits_t AD1DATA26bits __asm__ ("AD1DATA26") __attribute__((section("sfrs"), address(0xBF84B120)));
#define AD1DATA27 AD1DATA27
extern volatile uint32_t   AD1DATA27 __attribute__((section("sfrs"), address(0xBF84B124)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA27bits_t;
extern volatile __AD1DATA27bits_t AD1DATA27bits __asm__ ("AD1DATA27") __attribute__((section("sfrs"), address(0xBF84B124)));
#define AD1DATA28 AD1DATA28
extern volatile uint32_t   AD1DATA28 __attribute__((section("sfrs"), address(0xBF84B128)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA28bits_t;
extern volatile __AD1DATA28bits_t AD1DATA28bits __asm__ ("AD1DATA28") __attribute__((section("sfrs"), address(0xBF84B128)));
#define AD1DATA29 AD1DATA29
extern volatile uint32_t   AD1DATA29 __attribute__((section("sfrs"), address(0xBF84B12C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA29bits_t;
extern volatile __AD1DATA29bits_t AD1DATA29bits __asm__ ("AD1DATA29") __attribute__((section("sfrs"), address(0xBF84B12C)));
#define AD1DATA30 AD1DATA30
extern volatile uint32_t   AD1DATA30 __attribute__((section("sfrs"), address(0xBF84B130)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA30bits_t;
extern volatile __AD1DATA30bits_t AD1DATA30bits __asm__ ("AD1DATA30") __attribute__((section("sfrs"), address(0xBF84B130)));
#define AD1DATA31 AD1DATA31
extern volatile uint32_t   AD1DATA31 __attribute__((section("sfrs"), address(0xBF84B134)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA31bits_t;
extern volatile __AD1DATA31bits_t AD1DATA31bits __asm__ ("AD1DATA31") __attribute__((section("sfrs"), address(0xBF84B134)));
#define AD1DATA32 AD1DATA32
extern volatile uint32_t   AD1DATA32 __attribute__((section("sfrs"), address(0xBF84B138)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA32bits_t;
extern volatile __AD1DATA32bits_t AD1DATA32bits __asm__ ("AD1DATA32") __attribute__((section("sfrs"), address(0xBF84B138)));
#define AD1DATA33 AD1DATA33
extern volatile uint32_t   AD1DATA33 __attribute__((section("sfrs"), address(0xBF84B13C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA33bits_t;
extern volatile __AD1DATA33bits_t AD1DATA33bits __asm__ ("AD1DATA33") __attribute__((section("sfrs"), address(0xBF84B13C)));
#define AD1DATA34 AD1DATA34
extern volatile uint32_t   AD1DATA34 __attribute__((section("sfrs"), address(0xBF84B140)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA34bits_t;
extern volatile __AD1DATA34bits_t AD1DATA34bits __asm__ ("AD1DATA34") __attribute__((section("sfrs"), address(0xBF84B140)));
#define AD1DATA35 AD1DATA35
extern volatile uint32_t   AD1DATA35 __attribute__((section("sfrs"), address(0xBF84B144)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA35bits_t;
extern volatile __AD1DATA35bits_t AD1DATA35bits __asm__ ("AD1DATA35") __attribute__((section("sfrs"), address(0xBF84B144)));
#define AD1DATA36 AD1DATA36
extern volatile uint32_t   AD1DATA36 __attribute__((section("sfrs"), address(0xBF84B148)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA36bits_t;
extern volatile __AD1DATA36bits_t AD1DATA36bits __asm__ ("AD1DATA36") __attribute__((section("sfrs"), address(0xBF84B148)));
#define AD1DATA37 AD1DATA37
extern volatile uint32_t   AD1DATA37 __attribute__((section("sfrs"), address(0xBF84B14C)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA37bits_t;
extern volatile __AD1DATA37bits_t AD1DATA37bits __asm__ ("AD1DATA37") __attribute__((section("sfrs"), address(0xBF84B14C)));
#define AD1DATA38 AD1DATA38
extern volatile uint32_t   AD1DATA38 __attribute__((section("sfrs"), address(0xBF84B150)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA38bits_t;
extern volatile __AD1DATA38bits_t AD1DATA38bits __asm__ ("AD1DATA38") __attribute__((section("sfrs"), address(0xBF84B150)));
#define AD1DATA39 AD1DATA39
extern volatile uint32_t   AD1DATA39 __attribute__((section("sfrs"), address(0xBF84B154)));
typedef struct {
  uint32_t DATA:32;
} __AD1DATA39bits_t;
