MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECG124/mcu.h
#define _AD1GIRQEN1_AGIEN15_POSITION             0x0000000F
#define _AD1GIRQEN1_AGIEN15_MASK                 0x00008000
#define _AD1GIRQEN1_AGIEN15_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN16_POSITION             0x00000010
#define _AD1GIRQEN1_AGIEN16_MASK                 0x00010000
#define _AD1GIRQEN1_AGIEN16_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN17_POSITION             0x00000011
#define _AD1GIRQEN1_AGIEN17_MASK                 0x00020000
#define _AD1GIRQEN1_AGIEN17_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN18_POSITION             0x00000012
#define _AD1GIRQEN1_AGIEN18_MASK                 0x00040000
#define _AD1GIRQEN1_AGIEN18_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN19_POSITION             0x00000013
#define _AD1GIRQEN1_AGIEN19_MASK                 0x00080000
#define _AD1GIRQEN1_AGIEN19_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN20_POSITION             0x00000014
#define _AD1GIRQEN1_AGIEN20_MASK                 0x00100000
#define _AD1GIRQEN1_AGIEN20_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN21_POSITION             0x00000015
#define _AD1GIRQEN1_AGIEN21_MASK                 0x00200000
#define _AD1GIRQEN1_AGIEN21_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN22_POSITION             0x00000016
#define _AD1GIRQEN1_AGIEN22_MASK                 0x00400000
#define _AD1GIRQEN1_AGIEN22_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN23_POSITION             0x00000017
#define _AD1GIRQEN1_AGIEN23_MASK                 0x00800000
#define _AD1GIRQEN1_AGIEN23_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN24_POSITION             0x00000018
#define _AD1GIRQEN1_AGIEN24_MASK                 0x01000000
#define _AD1GIRQEN1_AGIEN24_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN25_POSITION             0x00000019
#define _AD1GIRQEN1_AGIEN25_MASK                 0x02000000
#define _AD1GIRQEN1_AGIEN25_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN26_POSITION             0x0000001A
#define _AD1GIRQEN1_AGIEN26_MASK                 0x04000000
#define _AD1GIRQEN1_AGIEN26_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN27_POSITION             0x0000001B
#define _AD1GIRQEN1_AGIEN27_MASK                 0x08000000
#define _AD1GIRQEN1_AGIEN27_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN28_POSITION             0x0000001C
#define _AD1GIRQEN1_AGIEN28_MASK                 0x10000000
#define _AD1GIRQEN1_AGIEN28_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN29_POSITION             0x0000001D
#define _AD1GIRQEN1_AGIEN29_MASK                 0x20000000
#define _AD1GIRQEN1_AGIEN29_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN30_POSITION             0x0000001E
#define _AD1GIRQEN1_AGIEN30_MASK                 0x40000000
#define _AD1GIRQEN1_AGIEN30_LENGTH               0x00000001

#define _AD1GIRQEN1_AGIEN31_POSITION             0x0000001F
#define _AD1GIRQEN1_AGIEN31_MASK                 0x80000000
#define _AD1GIRQEN1_AGIEN31_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN32_POSITION             0x00000000
#define _AD1GIRQEN2_AGIEN32_MASK                 0x00000001
#define _AD1GIRQEN2_AGIEN32_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN33_POSITION             0x00000001
#define _AD1GIRQEN2_AGIEN33_MASK                 0x00000002
#define _AD1GIRQEN2_AGIEN33_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN34_POSITION             0x00000002
#define _AD1GIRQEN2_AGIEN34_MASK                 0x00000004
#define _AD1GIRQEN2_AGIEN34_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN35_POSITION             0x00000003
#define _AD1GIRQEN2_AGIEN35_MASK                 0x00000008
#define _AD1GIRQEN2_AGIEN35_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN36_POSITION             0x00000004
#define _AD1GIRQEN2_AGIEN36_MASK                 0x00000010
#define _AD1GIRQEN2_AGIEN36_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN37_POSITION             0x00000005
#define _AD1GIRQEN2_AGIEN37_MASK                 0x00000020
#define _AD1GIRQEN2_AGIEN37_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN38_POSITION             0x00000006
#define _AD1GIRQEN2_AGIEN38_MASK                 0x00000040
#define _AD1GIRQEN2_AGIEN38_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN39_POSITION             0x00000007
#define _AD1GIRQEN2_AGIEN39_MASK                 0x00000080
#define _AD1GIRQEN2_AGIEN39_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN40_POSITION             0x00000008
#define _AD1GIRQEN2_AGIEN40_MASK                 0x00000100
#define _AD1GIRQEN2_AGIEN40_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN41_POSITION             0x00000009
#define _AD1GIRQEN2_AGIEN41_MASK                 0x00000200
#define _AD1GIRQEN2_AGIEN41_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN42_POSITION             0x0000000A
#define _AD1GIRQEN2_AGIEN42_MASK                 0x00000400
#define _AD1GIRQEN2_AGIEN42_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN43_POSITION             0x0000000B
#define _AD1GIRQEN2_AGIEN43_MASK                 0x00000800
#define _AD1GIRQEN2_AGIEN43_LENGTH               0x00000001

#define _AD1GIRQEN2_AGIEN44_POSITION             0x0000000C
#define _AD1GIRQEN2_AGIEN44_MASK                 0x00001000
#define _AD1GIRQEN2_AGIEN44_LENGTH               0x00000001

#define _AD1CSS1_CSS0_POSITION                   0x00000000
#define _AD1CSS1_CSS0_MASK                       0x00000001
#define _AD1CSS1_CSS0_LENGTH                     0x00000001

#define _AD1CSS1_CSS1_POSITION                   0x00000001
#define _AD1CSS1_CSS1_MASK                       0x00000002
#define _AD1CSS1_CSS1_LENGTH                     0x00000001

#define _AD1CSS1_CSS2_POSITION                   0x00000002
#define _AD1CSS1_CSS2_MASK                       0x00000004
#define _AD1CSS1_CSS2_LENGTH                     0x00000001

#define _AD1CSS1_CSS3_POSITION                   0x00000003
#define _AD1CSS1_CSS3_MASK                       0x00000008
#define _AD1CSS1_CSS3_LENGTH                     0x00000001

#define _AD1CSS1_CSS4_POSITION                   0x00000004
#define _AD1CSS1_CSS4_MASK                       0x00000010
#define _AD1CSS1_CSS4_LENGTH                     0x00000001

