MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2048ECG124/mcu.h
#define _SQI1INTSTAT_TXFULLIF_POSITION           0x00000001
#define _SQI1INTSTAT_TXFULLIF_MASK               0x00000002
#define _SQI1INTSTAT_TXFULLIF_LENGTH             0x00000001

#define _SQI1INTSTAT_TXTHRIF_POSITION            0x00000002
#define _SQI1INTSTAT_TXTHRIF_MASK                0x00000004
#define _SQI1INTSTAT_TXTHRIF_LENGTH              0x00000001

#define _SQI1INTSTAT_RXEMPTYIF_POSITION          0x00000003
#define _SQI1INTSTAT_RXEMPTYIF_MASK              0x00000008
#define _SQI1INTSTAT_RXEMPTYIF_LENGTH            0x00000001

#define _SQI1INTSTAT_RXFULLIF_POSITION           0x00000004
#define _SQI1INTSTAT_RXFULLIF_MASK               0x00000010
#define _SQI1INTSTAT_RXFULLIF_LENGTH             0x00000001

#define _SQI1INTSTAT_RXTHRIF_POSITION            0x00000005
#define _SQI1INTSTAT_RXTHRIF_MASK                0x00000020
#define _SQI1INTSTAT_RXTHRIF_LENGTH              0x00000001

#define _SQI1INTSTAT_CONFULLIF_POSITION          0x00000006
#define _SQI1INTSTAT_CONFULLIF_MASK              0x00000040
#define _SQI1INTSTAT_CONFULLIF_LENGTH            0x00000001

#define _SQI1INTSTAT_CONEMPTYIF_POSITION         0x00000007
#define _SQI1INTSTAT_CONEMPTYIF_MASK             0x00000080
#define _SQI1INTSTAT_CONEMPTYIF_LENGTH           0x00000001

#define _SQI1INTSTAT_CONTHRIF_POSITION           0x00000008
#define _SQI1INTSTAT_CONTHRIF_MASK               0x00000100
#define _SQI1INTSTAT_CONTHRIF_LENGTH             0x00000001

#define _SQI1INTSTAT_BDDONEIF_POSITION           0x00000009
#define _SQI1INTSTAT_BDDONEIF_MASK               0x00000200
#define _SQI1INTSTAT_BDDONEIF_LENGTH             0x00000001

#define _SQI1INTSTAT_PKTCOMPIF_POSITION          0x0000000A
#define _SQI1INTSTAT_PKTCOMPIF_MASK              0x00000400
#define _SQI1INTSTAT_PKTCOMPIF_LENGTH            0x00000001

#define _SQI1TXBUF_TXDATA_POSITION               0x00000000
#define _SQI1TXBUF_TXDATA_MASK                   0xFFFFFFFF
#define _SQI1TXBUF_TXDATA_LENGTH                 0x00000020

#define _SQI1RXBUF_RXDATA_POSITION               0x00000000
#define _SQI1RXBUF_RXDATA_MASK                   0xFFFFFFFF
#define _SQI1RXBUF_RXDATA_LENGTH                 0x00000020

#define _SQI1STAT1_RXBUFCNT_POSITION             0x00000000
#define _SQI1STAT1_RXBUFCNT_MASK                 0x000000FF
#define _SQI1STAT1_RXBUFCNT_LENGTH               0x00000008

#define _SQI1STAT1_TXBUFFREE_POSITION            0x00000010
#define _SQI1STAT1_TXBUFFREE_MASK                0x00FF0000
#define _SQI1STAT1_TXBUFFREE_LENGTH              0x00000008

#define _SQI1STAT2_TXOV_POSITION                 0x00000000
#define _SQI1STAT2_TXOV_MASK                     0x00000001
#define _SQI1STAT2_TXOV_LENGTH                   0x00000001

#define _SQI1STAT2_RXUN_POSITION                 0x00000001
#define _SQI1STAT2_RXUN_MASK                     0x00000002
#define _SQI1STAT2_RXUN_LENGTH                   0x00000001

#define _SQI1STAT2_SQID0_POSITION                0x00000003
#define _SQI1STAT2_SQID0_MASK                    0x00000008
#define _SQI1STAT2_SQID0_LENGTH                  0x00000001

#define _SQI1STAT2_SQID1_POSITION                0x00000004
#define _SQI1STAT2_SQID1_MASK                    0x00000010
#define _SQI1STAT2_SQID1_LENGTH                  0x00000001

#define _SQI1STAT2_SQID2_POSITION                0x00000005
#define _SQI1STAT2_SQID2_MASK                    0x00000020
#define _SQI1STAT2_SQID2_LENGTH                  0x00000001

#define _SQI1STAT2_SQID3_POSITION                0x00000006
#define _SQI1STAT2_SQID3_MASK                    0x00000040
#define _SQI1STAT2_SQID3_LENGTH                  0x00000001

#define _SQI1BDCON_DMAEN_POSITION                0x00000000
#define _SQI1BDCON_DMAEN_MASK                    0x00000001
#define _SQI1BDCON_DMAEN_LENGTH                  0x00000001

#define _SQI1BDCON_POLLEN_POSITION               0x00000001
#define _SQI1BDCON_POLLEN_MASK                   0x00000002
#define _SQI1BDCON_POLLEN_LENGTH                 0x00000001

#define _SQI1BDCON_START_POSITION                0x00000002
#define _SQI1BDCON_START_MASK                    0x00000004
#define _SQI1BDCON_START_LENGTH                  0x00000001

#define _SQI1BDCURADD_BDCURRADDR_POSITION        0x00000000
#define _SQI1BDCURADD_BDCURRADDR_MASK            0xFFFFFFFF
#define _SQI1BDCURADD_BDCURRADDR_LENGTH          0x00000020

#define _SQI1BDBASEADDR_BDADDR_POSITION          0x00000000
#define _SQI1BDBASEADDR_BDADDR_MASK              0xFFFFFFFF
#define _SQI1BDBASEADDR_BDADDR_LENGTH            0x00000020

#define _SQI1BDSTAT_BDCON_POSITION               0x00000000
#define _SQI1BDSTAT_BDCON_MASK                   0x0000FFFF
#define _SQI1BDSTAT_BDCON_LENGTH                 0x00000010

#define _SQI1BDSTAT_DMAACTV_POSITION             0x00000010
#define _SQI1BDSTAT_DMAACTV_MASK                 0x00010000
#define _SQI1BDSTAT_DMAACTV_LENGTH               0x00000001

#define _SQI1BDSTAT_DMASTART_POSITION            0x00000011
#define _SQI1BDSTAT_DMASTART_MASK                0x00020000
#define _SQI1BDSTAT_DMASTART_LENGTH              0x00000001

#define _SQI1BDSTAT_BDSTATE_POSITION             0x00000012
#define _SQI1BDSTAT_BDSTATE_MASK                 0x003C0000
#define _SQI1BDSTAT_BDSTATE_LENGTH               0x00000004

#define _SQI1BDPOLLCON_POLLCON_POSITION          0x00000000
#define _SQI1BDPOLLCON_POLLCON_MASK              0x0000FFFF
#define _SQI1BDPOLLCON_POLLCON_LENGTH            0x00000010

#define _SQI1BDTXDSTAT_TXCURBUFLEN_POSITION      0x00000000
#define _SQI1BDTXDSTAT_TXCURBUFLEN_MASK          0x000000FF
#define _SQI1BDTXDSTAT_TXCURBUFLEN_LENGTH        0x00000008

#define _SQI1BDTXDSTAT_TXBUFCNT_POSITION         0x00000010
#define _SQI1BDTXDSTAT_TXBUFCNT_MASK             0x001F0000
#define _SQI1BDTXDSTAT_TXBUFCNT_LENGTH           0x00000005

#define _SQI1BDTXDSTAT_TXSTATE_POSITION          0x00000019
#define _SQI1BDTXDSTAT_TXSTATE_MASK              0x1E000000
#define _SQI1BDTXDSTAT_TXSTATE_LENGTH            0x00000004

#define _SQI1BDRXDSTAT_RXCURBUFLEN_POSITION      0x00000000
#define _SQI1BDRXDSTAT_RXCURBUFLEN_MASK          0x000000FF
#define _SQI1BDRXDSTAT_RXCURBUFLEN_LENGTH        0x00000008

#define _SQI1BDRXDSTAT_RXBUFCNT_POSITION         0x00000010
#define _SQI1BDRXDSTAT_RXBUFCNT_MASK             0x001F0000
#define _SQI1BDRXDSTAT_RXBUFCNT_LENGTH           0x00000005

#define _SQI1BDRXDSTAT_RXSTATE_POSITION          0x00000019
#define _SQI1BDRXDSTAT_RXSTATE_MASK              0x1E000000
#define _SQI1BDRXDSTAT_RXSTATE_LENGTH            0x00000004

